hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/sf_rf_6lowpan.c
  return true;
}


uint8_t sf_rf_6lowpan_getTxPower(void)
{
    return cc1310.tx.signalStrength;
}


/* TX Power dBm lookup table - values from SmartRF Studio.
 * copied from the file:
 * C:\ti\tirtos_cc13xx_cc26xx_2_15_00_17\packages\examples\source\rf\easylink\EasyLink.c */
typedef struct S_OUTPUT_CONFIG {
  int8_t sc_dbm;
  uint16_t i_txPower; /* Value for the PROP_DIV_RADIO_SETUP.txPower field */
} s_outputConfig_t;

/* TX Power dBm lookup table - values from SmartRF Studio.
 * copied from the file:
 * C:\ti\tirtos_cc13xx_cc26xx_2_15_00_17\packages\examples\source\rf\easylink\EasyLink.c */
#define RF_OUTPUT_POWER_TBL_SIZE   16U
static const s_outputConfig_t s_outputPower[RF_OUTPUT_POWER_TBL_SIZE] = {
    {  0, 0x0041 },
    {  1, 0x10c3 },
    {  2, 0x1042 },
    {  3, 0x14c4 },
    {  4, 0x18c5 },
    {  5, 0x18c6 },
    {  6, 0x1cc7 },
    {  7, 0x20c9 },
    {  8, 0x24cb },
    {  9, 0x2ccd },
    { 10, 0x38d3 },
    { 11, 0x50da },
    { 12, 0xb818 },
    { 13, 0xa73f }, /* 12.5 */
    { 14, 0xa73f },
    {-10, 0x08c0 },
};


bool sf_rf_6lowpan_setTxPower(uint8_t c_signal)
{
    bool b_return = true;

#if USE_TI_RTOS
#if 0
    /** Variable to store the PA power during shutdown (only register lost) */
    static uint8_t gc_txPowerIdx;

    rfc_CMD_SET_TX_POWER_t s_cmdSetPower = {0};
    rfc_CMD_SCH_IMM_t s_immOpCmd = {0};
    rfc_CMD_PROP_RADIO_DIV_SETUP_t *ps_divSetup;
    RF_CmdHandle s_cmd;
    RF_EventMask e_result;

    s_cmdSetPower.commandNo = CMD_SET_TX_POWER;
    s_immOpCmd.commandNo = CMD_SCH_IMM;
    s_immOpCmd.startTrigger.triggerType = TRIG_NOW;
    s_immOpCmd.startTrigger.pastTrig = 1;
    s_immOpCmd.startTime = 0;

    /* Convert the input parameter to a index*/
    if(c_signal < 130U)
    {
      gc_txPowerIdx = 15;
    }
    else if (c_signal > 144)
    {
      gc_txPowerIdx = 14;
    }
    else
    {
      gc_txPowerIdx = c_signal-130;
    }

    /* If 14dBm power is requested then the CCFG_FORCE_VDDR_HH must be set in
     * the ccfg */
  #if (CCFG_FORCE_VDDR_HH != 0x1)
    if(gc_txPowerIdx == 14)
    {
      /* Decrement to a supported value */
      gc_txPowerIdx--;
    }
  #endif

    ps_divSetup = (rfc_CMD_PROP_RADIO_DIV_SETUP_t*)cc1310.conf.ps_cmdPropRadioDivSetup;
    /* Set the correct TX power */
    ps_divSetup->txPower = s_outputPower[gc_txPowerIdx].i_txPower;

    if(sf_rf_get_Status() != RF_STATUS_SLEEP)
    {
      /* CMD_SET_TX_POWER txPower is currently a bit filed in a struct, but will
       * change to a uint16 in future releases. Hence do a memcpy to cater for
       * both */
      memcpy(&(s_cmdSetPower.txPower), &(s_outputPower[gc_txPowerIdx].i_txPower),
              sizeof(uint16_t));

      /* point the Operational Command to the immediate set power command */
      s_immOpCmd.cmdrVal = (uint32_t) &s_cmdSetPower;

      if(gps_rfHandle != NULL)
      {
        /* Send command */
        s_cmd = RF_postCmd(gps_rfHandle,(RF_Op*)&s_immOpCmd, RF_PriorityNormal, NULL, 0);
        e_result = RF_pendCmd(gps_rfHandle, s_cmd, (RF_EventLastCmdDone |RF_EventCmdError));
        if ((e_result & RF_EventLastCmdDone) == false)
        {
          b_return = false;
        }/* if */
      }/* if */
    }/* if */
#endif
#else
    /** Command for setting the tx power */
    rfc_CMD_SET_TX_POWER_t s_cmdTxPower;
    s_cmdTxPower.commandNo = CMD_SET_TX_POWER;


    /* check if the radio is in sleepy mode */
    if( sf_rf_get_Status() == RF_STATUS_SLEEP)
        return false;
    /* Values from smart rf studio v2.1.0 */
    /* Set the minimum */
    if(c_txPower <= 124U) /* -10dbm */
    {
      s_cmdTxPower.txPower.IB =        0x00U;
      s_cmdTxPower.txPower.GC =        0x03U;
      s_cmdTxPower.txPower.boost =     0x00U;
      s_cmdTxPower.txPower.tempCoeff = 0x00U;
      cc1310.tx.signalStrength = 120U;
    }
    /* Set the maximum */
    else if(c_txPower >= 144) /*  14dbm */
    {
      s_cmdTxPower.txPower.IB =        0x3FU;
      s_cmdTxPower.txPower.GC =        0x00U;
      s_cmdTxPower.txPower.boost =     0x01U;
      s_cmdTxPower.txPower.tempCoeff = 0x00U;
      cc1310.tx.signalStrength = 144U;
    }
    /* Calculate the register settings */
    else
    {
      /* Check which setting should be used. */
      switch(c_txPower)
      {
      case 143U:                                                     /* 13dBm */
        s_cmdTxPower.txPower.IB =        0x3FU;
        s_cmdTxPower.txPower.GC =        0x00U;
        s_cmdTxPower.txPower.boost =     0x00U;
        s_cmdTxPower.txPower.tempCoeff = 0x00U;
        break;

      case 142U:                                                     /* 12dBm */
        s_cmdTxPower.txPower.IB =        0x14U;
        s_cmdTxPower.txPower.GC =        0x00U;
        s_cmdTxPower.txPower.boost =     0x00U;
        s_cmdTxPower.txPower.tempCoeff = 0x00U;
        break;

      case 141U: case 140U: case 139U: case 138U:                    /* 10dBm */
        s_cmdTxPower.txPower.IB =        0x11U;
        s_cmdTxPower.txPower.GC =        0x03U;
        s_cmdTxPower.txPower.boost =     0x00U;
        s_cmdTxPower.txPower.tempCoeff = 0x00U;
        break;

      case 137U: case 136U: case 135U: case 134U: case 133U:         /*  5dBm */
        s_cmdTxPower.txPower.IB =        0x05U;
        s_cmdTxPower.txPower.GC =        0x03U;
        s_cmdTxPower.txPower.boost =     0x00U;
        s_cmdTxPower.txPower.tempCoeff = 0x00U;
        break;

      case 132U: case 131U: case 130U: case 129U: case 128U: case 127U:
      case 126U: case 125U:                                          /*  0dBm */
        s_cmdTxPower.txPower.IB =        0x02U;
        s_cmdTxPower.txPower.GC =        0x03U;
        s_cmdTxPower.txPower.boost =     0x00U;
        s_cmdTxPower.txPower.tempCoeff = 0x00U;
        break;
      }
      cc1310.tx.signalStrength = c_txPower;
    }

      /* Transmit the tx power setting to the rf-core */
      MB_SendCommand((uint32_t) &s_cmdTxPower);
#endif
    return b_return;
}


uint8_t sf_rf_6lowpan_getRssi(void)
{
  return sf_rf_getRssi();
}


E_RF_CCA_RESULT_t sf_rf_6lowpan_cca(uint8_t c_numOfRssiMeas)
{
  E_RF_CCA_RESULT_t e_return;
  uint8_t returnValue;

  if( sf_rf_get_Status() == RF_STATUS_SLEEP )
      return E_RF_CCA_RESULT_INVALID_RF_STATE;
  /* set number of RSSI measurement */
  sf_rf_set_numOfRssiMeas(c_numOfRssiMeas);
  returnValue=sf_rf_switchState(RF_STATUS_CCA);
  if(returnValue == ROUTINE_CCA_RESULT_IDLE)
    e_return = E_RF_CCA_RESULT_IDLE;
  else if (returnValue == ROUTINE_CCA_RESULT_BUSY )
    e_return = E_RF_CCA_RESULT_BUSY;
  else
    e_return = E_RF_CCA_RESULT_INVALID_RF_STATE;
  /* Set the transceiver in RX mode */
  sf_rf_switchState(RF_STATUS_RX_LISTEN);
  return e_return;
}


 bool sf_rf_6lowpan_chanNumSet(uint8_t chan_num)
{
  uint8_t retVal;
  uint16_t Cent_freq;
  uint16_t Frac_Freq;
  uint16_t Delta;
  uint8_t OpMode=1;
  /* verify if the channel is supported */
  if(chan_num > 33)
      return false;
  /* check the operation mode */
  switch(OpMode)
  {
  case 1 :
    Cent_freq=0x035F;
    Frac_Freq=0x2000;
    Delta=0x3333;
    /* calculate the frequency parameters for desired channel */
    Cent_freq = Cent_freq + (chan_num / 5);
    Frac_Freq = Frac_Freq + (chan_num % 5) * Delta;
    break;
  default:
    return false;
  }
  /* check if the radio is in sleepy mode */
  if( (sf_rf_get_Status()== RF_STATUS_SLEEP))
  {
    /* update frequency without running command: it will be executed when the radio wake up */
    if(sf_rf_update_frequency(Cent_freq, Frac_Freq))
      return true;
    else
      return false;
  }
  /* check if the radio is in RX mode */
  if( (sf_rf_get_Status()== RF_STATUS_RX_LISTEN) )
  {
      /* update frequency */
      if(sf_rf_update_run_frequency(Cent_freq, Frac_Freq))
        retVal= true;
      else
        retVal= false;
      /* Set the transceiver in RX mode */
      sf_rf_switchState(RF_STATUS_RX_LISTEN);
  }
  else
      retVal= false;
return retVal;
}



/*==============================================================================
                             FUNCTION
==============================================================================*/

 /* TI RTOS variables */
 #if USE_TI_RTOS
 /* TI-RTOS RF Mode Object */
 RF_Mode RF_prop =
 {
     .rfMode = RF_MODE_PROPRIETARY_SUB_1,
     .cpePatchFxn = &rf_patch_cpe_genfsk,
     .mcePatchFxn = 0,
     .rfePatchFxn = &rf_patch_rfe_genfsk,
 };

