hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/sf_rf_6lowpan.c
#define RF_RTOS_EVENT_MASK    ( RF_EventLastCmdDone | RF_EventRxOk | \
		RF_EventRxNOk | \
		RF_EventInternalError | \
		RF_EventRxBufFull | RF_EventRxIgnored | RF_EventRxAborted )


static uint8_t flag_cca = 0;

static void cca_callback(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
	flag_cca = 1 ;
}

static void Rtos_callback(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
    if (e & RF_EventRxOk)
    {
      rx_call_back(IRQ_RX_OK );
    }
    else if (e & RF_EventRxNOk)
	{
      rx_call_back(IRQ_RX_NOK );
    }
    else if (e & RF_EventInternalError)
    {
      rx_call_back(IRQ_INTERNAL_ERROR);
    }
    else if (e & (RF_EventRxBufFull | RF_EventRxIgnored | RF_EventRxAborted))
   {
      rx_call_back(IRQ_RX_BUF_FULL);
   }
}
#endif /* USE_TI_RTOS */


static bool rf_driver_init(void)
{
#if USE_TI_RTOS

  RF_Params_init(&gs_rfParams);
  if(gps_rfHandle == NULL)
    gps_rfHandle = RF_open(&gs_rfObject, &RF_prop, (RF_RadioSetup*) &RF_802_15_4_cmdPropRadioDivSetup , &gs_rfParams);
  if(gps_rfHandle != NULL)
    return true;
  else
	return false;

#else
  rfc_returnValue_t returnValue;

  returnValue = RFC_selectRadioMode(RFC_GFSK);
  if(returnValue == RFC_OK)
  {
    /* 1.2. Enable RF Core */
    returnValue = RFC_enableRadio();
    if(returnValue == RFC_OK)
    {
      /* 1.3. Switch to HF XTAL. Needs to be done before running the RFC setup. */
      loc_switchToHfXtalOsc();
      return true;
    }
  }
  return false;
#endif
}


static void rx_call_back(uint32_t l_flag)
{
  if(IRQ_RX_OK == (l_flag & IRQ_RX_OK))
  {
      if (cc1310.tx.Tx_waiting_Ack)
      {
          cc1310.rx.p_lastPkt = (uint8_t*)(&cc1310.rx.p_currentDataEntry->data) ;
          if ((cc1310.rx.p_lastPkt[PHY_HEADER_LEN] == 0x02) &&
                  (cc1310.rx.p_lastPkt[PHY_HEADER_LEN + 2] == cc1310.tx.expSeqNo))
          {
              cc1310.tx.Ack_received=1;
          }
          else
          {
              cc1310.tx.Ack_received=0;
          }
          cc1310.rx.p_currentDataEntry->status=DATA_ENTRY_PENDING;
      }
      else
      {
        /* signal complete reception interrupt */
        en_evprocResCode_t err = RF_SEM_POST(NETSTK_RF_EVENT);
        /* handle the received packet */
        sf_rf_switchState(RF_STATUS_RX);
      }
      /* set RX mode again */
      sf_rf_switchState(RF_STATUS_RX_LISTEN);
      bsp_led( HAL_LED1, EN_BSP_LED_OP_OFF );
      bsp_led( HAL_LED0, EN_BSP_LED_OP_ON );
      bsp_led( HAL_LED3, EN_BSP_LED_OP_BLINK );
  }
  else if(IRQ_RX_NOK == (l_flag & IRQ_RX_NOK))
  {
    /* set RX mode again */
    sf_rf_switchState(RF_STATUS_RX_LISTEN);
    bsp_led( HAL_LED1, EN_BSP_LED_OP_ON );
    bsp_led( HAL_LED0, EN_BSP_LED_OP_OFF );
    bsp_led( HAL_LED3, EN_BSP_LED_OP_BLINK );
  }
  else if(IRQ_INTERNAL_ERROR == (l_flag & IRQ_INTERNAL_ERROR))
  {
      /* Initialize the driver again */
      if(sf_rf_switchState(RF_STATUS_INIT) != ROUTINE_DONE )
          sf_rf_switchState(RF_STATUS_ERROR);
      /* Send RX command to the radio */
      if(sf_rf_switchState(RF_STATUS_RX_LISTEN)!= ROUTINE_DONE)
          sf_rf_switchState(RF_STATUS_ERROR);
    bsp_led( HAL_LED1, EN_BSP_LED_OP_ON );
    bsp_led( HAL_LED0, EN_BSP_LED_OP_ON );
  }
  else if((IRQ_RX_BUF_FULL == (l_flag & IRQ_RX_BUF_FULL)) || (IRQ_RX_IGNORED == (l_flag & IRQ_RX_IGNORED))
          || (IRQ_RX_ABORTED == (l_flag & IRQ_RX_ABORTED)) )
  {
    /* set RX mode again */
    sf_rf_switchState(RF_STATUS_RX_LISTEN);
    bsp_led( HAL_LED1, EN_BSP_LED_OP_ON );
    bsp_led( HAL_LED0, EN_BSP_LED_OP_ON );
  }
}


static uint8_t sf_rf_switchState(e_rf_status_t state)
{
#if USE_TI_RTOS
	RF_EventMask result ;
#else
  /* Return value of lib functions */
  static rfc_returnValue_t returnValue;
  /* State of the receiver */
  static rfc_cmdStatus_t cmdStatus;
#endif
  volatile uint16_t i = 0x00U;
  e_nsErr_t err;


  /* check wheter we have to update the state or not */
  if(state!=RF_STATUS_NONE)
    cc1310.state=state;

  switch(cc1310.state)
  {
  case RF_STATUS_INIT :
    if(rf_driver_init())
    {
      /* initiate command pointer */
      cc1310.conf.ps_cmdPropRadioDivSetup=(rfc_radioOp_t*)&RF_802_15_4_cmdPropRadioDivSetup;
      cc1310.conf.ps_cmdFs=(rfc_radioOp_t*)&RF_802_15_4_cmdFs;
      cc1310.rx.p_cmdPropRxAdv=&RF_802_15_4_cmdPropRxAdv;
      cc1310.tx.p_cmdPropTxAdv=&RF_802_15_4_cmdPropTxAdv;

      /*initiate CCA command */
      sf_rf_set_numOfRssiMeas(CC13xx_NUM_OFF_RSSI_CHECKS_DEFAULT);
      sf_rf_init_cca_cmd();

#if USE_TI_RTOS
      /* Set the frequency */
      gps_rf_cmdHandle = RF_postCmd(gps_rfHandle, (RF_Op*)cc1310.conf.ps_cmdFs, RF_PriorityNormal, NULL, 0);
      if(gps_rf_cmdHandle < 0 )
       {
          bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
          return ROUTINE_ERROR_FS_CMD ;
       }
#else
      /* disable  interrupt  */
      RFC_registerCpe0Isr(NULL);
      RFC_registerCpe1Isr(NULL);
      RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));

      /* enable radio again */
      if (RFC_enableRadio() != RFC_OK)
      {
        bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
        return ROUTINE_ERROR_ENABLE_RADIO;
      }

      returnValue = RFC_setupRadio(cc1310.conf.ps_cmdPropRadioDivSetup);
      if(returnValue == RFC_OK)
      {
        /* Send CMD_FS command to RF Core */
        for(i; i<0x7FFF;i++);
        cmdStatus = RFC_sendRadioOp(cc1310.conf.ps_cmdFs);
        if(cmdStatus != RFC_CMDSTATUS_DONE)
        {
          bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
          return ROUTINE_ERROR_FS_CMD ;
        }
      }
      else
          return ROUTINE_ERROR_SETUP_RADIO;

      /* Initialize interrupts */
      RFC_registerCpe0Isr(rx_call_back);
      RFC_enableCpe0Interrupt(IRQ_RX_OK);
      RFC_enableCpe0Interrupt(IRQ_RX_NOK);
      RFC_enableCpe0Interrupt(IRQ_RX_ABORTED);
      RFC_enableCpe0Interrupt(IRQ_INTERNAL_ERROR);
      RFC_enableCpe0Interrupt(IRQ_RX_BUF_FULL);
      RFC_enableCpe0Interrupt(IRQ_RX_IGNORED);

#endif

      /* initialize RX queue */
      if(RFQueue_defineQueue(&cc1310.rx.dataQueue, RxBuff, RX_BUFF_SIZE , 2 , 150 + 3 ) != 0x00U)
      {
        /* Failed to allocate space for all data entries */
        bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
        return ROUTINE_ERROR_INIT_QUEUE ;
      }

      /* reset the waiting for ACK flag */
      cc1310.tx.Tx_waiting_Ack=0;
      /* Initialize global variable. Set the lowest RSSI value as default -255dBm */
      cc1310.rx.c_rssiValue=0xFFU;
      /* set the default TX power */
      cc1310.tx.signalStrength=RF_DEFAULT_TX_POWER;
      return ROUTINE_DONE ;
    }
    else
    {
      bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
      return ROUTINE_ERROR_INIT_RF ;
    }
  case RF_STATUS_IDLE :
    break;
  case RF_STATUS_SLEEP :
#if USE_TI_RTOS
	  return ROUTINE_DONE;
#else
      /* disable  interrupt  */
      RFC_registerCpe0Isr(NULL);

      /* Disable radio core */
      if (RFC_disableRadio() != RFC_OK)
      {
          return ROUTINE_ERROR_DISABLE_RADIO;
      }
      return ROUTINE_DONE;
#endif
  case RF_STATUS_TX :
      /* find out if ACK is required */
      cc1310.tx.Tx_waiting_Ack = packetbuf_attr(PACKETBUF_ATTR_MAC_ACK);
      if(cc1310.tx.Tx_waiting_Ack)
      {
      cc1310.tx.Ack_received=0;
      cc1310.tx.expSeqNo = packetbuf_attr(PACKETBUF_ATTR_MAC_SEQNO);

