hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/sf_rf_6lowpan.c
      /* Get the ACK wait from buffer */
      cc1310.tx.waitForAckTimeout = (uint16_t) packetbuf_attr(PACKETBUF_ATTR_MAC_ACK_WAIT_DURATION);
      }
#if USE_TI_RTOS


#if NETSTK_CFG_IEEE_802154G_EN
      memcpy(temp,cc1310.tx.p_cmdPropTxAdv->pPkt,2);
      /* Stop last cmd (usually it is Rx cmd ) */
      RF_cancelCmd(gps_rfHandle, gps_rf_cmdHandle, 1);
      memcpy(cc1310.tx.p_cmdPropTxAdv->pPkt, temp,2);
      /* Send tx command  */
      result = RF_runCmd(gps_rfHandle, (RF_Op*)cc1310.tx.p_cmdPropTxAdv, RF_PriorityNormal, NULL, 0);
#else
      /* Stop last cmd (usually it is Rx cmd ) */
      RF_cancelCmd(gps_rfHandle, gps_rf_cmdHandle, 1);
      /* Send tx command  */
      result = RF_runCmd(gps_rfHandle, (RF_Op*)cc1310.tx.p_cmdPropTxAdv, RF_PriorityNormal, NULL, 0);
#endif
      if (!(result & RF_EventLastCmdDone))
      {
        return ROUTINE_ERROR_TX_CMD;
      }
      else
      {
        /* if the packet doesn't require ACK then we finish with success once the packet is send */
         if(cc1310.tx.Tx_waiting_Ack==0)
           return ROUTINE_DONE ;

         /* Stop last cmd (usually it is Rx cmd ) */
        // RF_cancelCmd(gps_rfHandle, gps_rf_cmdHandle, 1);

         cc1310.rx.p_currentDataEntry=(rfc_dataEntryGeneral_t*)cc1310.rx.dataQueue.pCurrEntry;
         cc1310.rx.p_currentDataEntry->status=DATA_ENTRY_PENDING;

         /* Post CMD_PROP_RX command to RF Core (non-blocking function )*/
         gps_rf_cmdHandle = RF_postCmd(gps_rfHandle, (RF_Op*)cc1310.rx.p_cmdPropRxAdv, RF_PriorityHighest, &Rtos_callback, RF_RTOS_EVENT_MASK);

         /* FIXME wait for ACK */
         //bsp_delay_us(cc1310.tx.waitForAckTimeout);
         for(i; i<0x2FFD;i++);
         /* stop waiting for ACK */
         cc1310.tx.Tx_waiting_Ack=0;
         if(cc1310.tx.Ack_received)
           return ROUTINE_DONE;
         else
           return ROUTINE_ERROR_TX_NOACK;
      }
#else
      /* Stop last cmd (usually it is Rx cmd ) */
      RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));
      /* Send tx command  */
      cmdStatus = RFC_sendRadioOp((rfc_radioOp_t*)cc1310.tx.p_cmdPropTxAdv);

      /* Since we sent a blocking cmd then we check the state */
      if(cmdStatus != RFC_CMDSTATUS_DONE)
      {
        bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
        return ROUTINE_ERROR_TX_CMD ;
      }
      else
      {
          /* if the packet doesn't require ACK then we finish with success once the packet is send */
          if(cc1310.tx.Tx_waiting_Ack==0)
              return ROUTINE_DONE ;
          /* Send CMD_PROP_RX command to RF Core */
          RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));
          cc1310.rx.p_currentDataEntry=(rfc_dataEntryGeneral_t*)cc1310.rx.dataQueue.pCurrEntry;
          cc1310.rx.p_currentDataEntry->status=DATA_ENTRY_PENDING;
          /* Send Rx command to receive the ACK */
          cmdStatus=RFC_sendRadioOp_nb((rfc_radioOp_t*)cc1310.rx.p_cmdPropRxAdv , NULL);
          /* FIXME wait for ACK */
          //bsp_delay_us(cc1310.tx.waitForAckTimeout);
          for(i; i<0x2FFD;i++); // 3 ms
          /* stop waiting for ACK */
          cc1310.tx.Tx_waiting_Ack=0;
          if(cc1310.tx.Ack_received)
              return ROUTINE_DONE;
          else
              return ROUTINE_ERROR_TX_NOACK;
      }
#endif
  case RF_STATUS_RX_LISTEN :
    cc1310.rx.p_currentDataEntry=(rfc_dataEntryGeneral_t*)cc1310.rx.dataQueue.pCurrEntry;
    /* Set the Data Entity queue for received data */
    cc1310.rx.p_cmdPropRxAdv->pQueue = &cc1310.rx.dataQueue;
    /* Set rx statistics output struct */
    cc1310.rx.p_cmdPropRxAdv->pOutput= (uint8_t*)&cc1310.rx.rxStatistics;

#if USE_TI_RTOS
    /* Stop last cmd (usually it is Rx cmd ) */
    RF_cancelCmd(gps_rfHandle, gps_rf_cmdHandle, 1);
    /* Post CMD_PROP_RX command to RF Core (non-blocking function )*/
    gps_rf_cmdHandle = RF_postCmd(gps_rfHandle, (RF_Op*)cc1310.rx.p_cmdPropRxAdv, RF_PriorityNormal, &Rtos_callback, RF_RTOS_EVENT_MASK);
    /*  check the return value */
    if(gps_rf_cmdHandle < 0 )
    {
      bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
      return ROUTINE_ERROR_RX_CMD ;
    }
    return ROUTINE_DONE ;
#else
    /* Stop last command */
    RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));
    /* Send CMD_PROP_RX command to RF Core */
    cmdStatus=RFC_sendRadioOp_nb((rfc_radioOp_t*)cc1310.rx.p_cmdPropRxAdv , NULL);
    if(cmdStatus != RFC_CMDSTATUS_DONE)
    {
      bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
      return ROUTINE_ERROR_RX_CMD ;
    }
    return ROUTINE_DONE ;
#endif

  case RF_STATUS_RX :
  {
    /* when we receive data */
#if NETSTK_CFG_IEEE_802154G_EN
	uint8_t *p_data = (uint8_t*)(&cc1310.rx.p_currentDataEntry->data);
	uint8_t tempData;

    /* FIXME flip PHR back */
	tempData = p_data[0];
	p_data[0] = p_data[1];
	p_data[1] = tempData;

    cc1310.rx.LenLastPkt = phy_framer802154_getPktLen(p_data, PHY_HEADER_LEN) + PHY_HEADER_LEN;
    cc1310.rx.p_lastPkt = p_data;
#else
     /* FIXME this is not correct if the packet is lager 127 */
    cc1310.rx.LenLastPkt = *(uint8_t*)(&cc1310.rx.p_currentDataEntry->data) + PHY_HEADER_LEN;
    cc1310.rx.p_lastPkt = (uint8_t*)(&cc1310.rx.p_currentDataEntry->data);
#endif
    /* parse the received packet to check whether it requires ACK or not */
    framer802154ll_parse(&frame, cc1310.rx.p_lastPkt , cc1310.rx.LenLastPkt );

   if(frame.is_ack_required)
   {
    /* create the ACK  */
    ack_length=framer802154ll_createAck(&frame,ack, sizeof(ack));
#if !NETSTK_CFG_IEEE_802154G_EN
    /* configure ACK length and ptr */
    cc1310.tx.p_cmdPropTxAdv->pktLen = ack_length - frame.crc_len;
    cc1310.tx.p_cmdPropTxAdv->pPkt = ack;
#else
    /* configure ACK length and ptr */
    cc1310.tx.p_cmdPropTxAdv->pPkt = ack;
    cc1310.tx.p_cmdPropTxAdv->pktLen = ack_length - frame.crc_len  ;
    /* FIXME overwrite PHR */
    uint16_t transmitLen = cc1310.tx.p_cmdPropTxAdv->pktLen - PHY_HEADER_LEN;
    uint16_t totalLen = transmitLen + frame.crc_len;
    /* FIXME only support CRC-32 */
	cc1310.tx.p_cmdPropTxAdv->pPkt[0] = totalLen & 0xFF;
	/* check whether the 32-bits and 16-bits CRC is used // 0x10: 16-bits CRC and 0x00 : 32-bits CRC */
	if(frame.crc_len == 2)
      cc1310.tx.p_cmdPropTxAdv->pPkt[1] = (totalLen >> 8) + 0x10  ;
	else
	  cc1310.tx.p_cmdPropTxAdv->pPkt[1] = (totalLen >> 8) + 0x00  ;
#endif
#if USE_TI_RTOS

    /* Send tx command  */
    RF_postCmd(gps_rfHandle, (RF_Op*)cc1310.tx.p_cmdPropTxAdv, RF_PriorityHighest, NULL , 0 );
    /* wait the command until it finish */
    for(i; i<0x0FFD;i++);

#else
    /* Send Tx command to send the ACK */
    RFC_sendRadioOp_nb((rfc_radioOp_t*)cc1310.tx.p_cmdPropTxAdv,NULL);
    /* wait for the command until finish */
    uint16_t wdog = 0xFFFF;
    while(cc1310.tx.p_cmdPropTxAdv->status != PROP_DONE_OK && wdog)
    {
      wdog--;
    }
#endif
    }
   /* Get RSSI value from the queue : The RSSI is given on signed form in dBm.
    * If no RSSI is available, this is signaled with a special value of the RSSI (-128, or 0x80) */
   cc1310.rx.c_rssiValue=(uint8_t) cc1310.rx.p_lastPkt[cc1310.rx.LenLastPkt];
   /* switch to the next entry */
   RFQueue_nextEntry();
   /* Get the current entry and it to pending state */
   cc1310.rx.p_currentDataEntry = (rfc_dataEntryGeneral_t*)RFQueue_getDataEntry();
   cc1310.rx.p_currentDataEntry->status=DATA_ENTRY_PENDING;
    return ROUTINE_DONE ;
  }
  case RF_STATUS_CCA :
#if USE_TI_RTOS
	    /* Stop last cmd (usually it is Rx cmd ) */
	    RF_cancelCmd(gps_rfHandle, gps_rf_cmdHandle, 1);
	    /* update command */
	       cc1310.cca.s_cmdCS.numRssiBusy =cc1310.cca.c_numOfRssiMeas;
	       cc1310.cca.s_cmdCS.numRssiIdle =cc1310.cca.c_numOfRssiMeas;
	    /* Start carrier sense */
	    gps_rf_cmdHandle = RF_postCmd(gps_rfHandle, (RF_Op*)&cc1310.cca.s_cmdCS, RF_PriorityHighest, &cca_callback , (RF_EventLastCmdDone | RF_EventCmdError) );
	    /* TODO add watch dog */
	    while(!flag_cca);
	    flag_cca = 0 ;
        /* Check the status of the CS command */
        if(cc1310.cca.s_cmdCS.status == PROP_DONE_IDLE)
        {
          return ROUTINE_CCA_RESULT_IDLE;
        }
        else
          return ROUTINE_CCA_RESULT_BUSY;
#else
    /* Stop last cmd (usually it is Rx cmd ) */
    RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));
    /* update command */
    cc1310.cca.s_cmdCS.numRssiBusy =cc1310.cca.c_numOfRssiMeas;
    cc1310.cca.s_cmdCS.numRssiIdle =cc1310.cca.c_numOfRssiMeas;
    /* Start carrier sense */
    cmdStatus = RFC_sendRadioOp((rfc_radioOp_t*)&cc1310.cca.s_cmdCS);
    /* Check if the command was processed correctly */
    if(cmdStatus == RFC_CMDSTATUS_DONE)
    {
      /* Check the status of the CS command */
      if(cc1310.cca.s_cmdCS.status == PROP_DONE_IDLE)
      {
        return ROUTINE_CCA_RESULT_IDLE;
      }
      else
        return ROUTINE_CCA_RESULT_BUSY;
    }
    return ROUTINE_CCA_ERROR_STATE;
#endif

  case RF_STATUS_ERROR :
      /* Call emb6 error handler */
      err = NETSTK_ERR_FATAL;
      emb6_errorHandler(&err);
      return ROUTINE_FATAL_ERROR;
  };
  return ROUTINE_DONE ;
}

